{
    "name": "Daniil Krasilnikov",
    "logo_name": "dankrasilnikov",
    "role": "FullStack Developer | IoT & Robotics Enthusiast",
    "about": {
        "sections": {
            "professional-info": {
                "title": "Professional Info",
                "icon": "icons/info-professional.svg",
                "info": {
                    "experience": {
                        "title": "Experience",
                        "description": "<br>With over 4 years of professional experience, I have developed scalable web applications, worked on innovative IoT solutions, and contributed to high-performance backend systems. My portfolio includes projects ranging from user-friendly interfaces to data-intensive platforms. I excel in delivering quality work under tight deadlines and am passionate about implementing creative and effective solutions for challenging problems."
                    },
                    "hard-skills": {
                        "title": "Hard Skills",
                        "description": "<br>I specialize in modern web technologies like React, Vue, and Angular for frontend development, and Node.js with Express for backend systems. My expertise extends to databases such as MongoDB and PostgreSQL. In IoT, I have worked extensively with protocols like MQTT and WebSockets, integrating hardware like Raspberry Pi and Arduino to create functional prototypes and production-level solutions."
                    },
                    "soft-skills": {
                        "title": "Soft Skills",
                        "description": "<br>I am a collaborative team player with strong communication skills. My ability to lead and manage projects ensures timely delivery of tasks without compromising quality. I am highly adaptable, detail-oriented, and driven by a passion for continuous learning and self-improvement."
                    }
                }
            },
            "personal-info": {
                "title": "Personal Info",
                "icon": "icons/info-personal.svg",
                "info": {
                    "bio": {
                        "title": "Bio",
                        "description": "<br>Hello! I'm Daniil Krasilnikov, a FullStack Developer with a strong interest in IoT and robotics. I enjoy solving complex challenges and exploring the intersection of hardware and software to create impactful projects. My passion lies in building innovative systems that make a difference in people's lives."
                    },
                    "interests": {
                        "title": "Interests",
                        "description": "<br>I'm deeply interested in emerging technologies, particularly IoT, robotics, and artificial intelligence. Beyond coding, I enjoy reading about technological advancements, contributing to open-source projects, and exploring creative applications of technology in various industries."
                    },
                    "education": {
                        "title": "Education",
                        "description": "<br>I am currently pursuing a degree in Computer Science, focusing on artificial intelligence and IoT systems. In addition to formal education, I have completed multiple online courses and certifications, constantly improving my skills in programming, system design, and robotics.",
                        "files": {
                            "high-school": "Graduated with honors from Las Viñas High School, where I developed a strong foundation in mathematics and computer science.",
                            "university": "Currently enrolled in a Computer Science program, specializing in IoT systems and AI applications."
                        }
                    }
                }
            },
            "hobbies-info": {
                "title": "Hobbies",
                "icon": "icons/info-hobbies.svg",
                "info": {
                    "sports": {
                        "title": "Sports",
                        "description": "<br>Sports are an essential part of my life. I enjoy playing basketball, cycling, and running. Staying active not only keeps me physically fit but also sharpens my focus and problem-solving abilities."
                    },
                    "favorite-games": {
                        "title": "Favorite Games",
                        "description": "<br>As a gamer, I enjoy strategy and puzzle games that challenge my thinking, such as Chess and Tetris. Gaming inspires me to approach problems creatively and explore unconventional solutions."
                    }
                }
            }
        }
    },
    "contacts": {
        "direct": {
            "title": "Contact Me",
            "sources": {
                "email": "krasilnikov.orchid@gmail.com",
                "phone": "+995599477339"
            }
        },
        "social": {
            "github": {
                "title": "GitHub Profile",
                "url": "https://github.com/dankrasilnikov",
                "user": "dankrasilnikov"
            },
            "linkedin": {
                "title": "LinkedIn Profile",
                "url": "https://www.linkedin.com/in/daniil-krasilnikov/",
                "user": "daniil-krasilnikov"
            },
            "twitter": {
                "title": "Twitter",
                "url": "https://twitter.com/username",
                "user": "username"
            }
        },
        "find_me_also_in": {
            "title": "Find Me Also In",
            "sources": {
                "threads": {
                    "title": "Threads",
                    "url": "https://www.threads.net/@dan_krasilnikov",
                    "user": "dan_krasilnikov"
                },
                "instagram": {
                    "title": "Instagram",
                    "url": "https://www.instagram.com/dan_krasilnikov/",
                    "user": "dan_krasilnikov"
                }
            }
        }
    },
    "gists": {
        "1": "83861a67e377633ee8368df01ee3a355",
        "2": "694c1f32332788a2ac7f37b09e5aa40e"
    },
    "projects": {
        "1": {
            "title": "UI Animations",
            "description": "Developed engaging UI animations using Flutter, enhancing user interaction and experience for cross-platform applications.",
            "img": "/images/projects/ui-animations2.png",
            "tech": ["Flutter"],
            "url": "https://github.com/"
        },
        "2": {
            "title": "AI Resources",
            "description": "Created a resource hub for AI tools and technologies using Gatsby, focusing on accessibility and user-friendly design.",
            "img": "/images/projects/ai-resources.png",
            "tech": ["Gatsby"],
            "url": "https://github.com/"
        },
        "3": {
            "title": "World Map",
            "description": "Built an interactive world map application using Angular, providing users with dynamic data visualization capabilities.",
            "img": "/images/projects/worldmap.png",
            "tech": ["Angular"],
            "url": "https://github.com/"
        },
        "4": {
            "title": "Tetris Game",
            "description": "Designed and developed a fully functional Tetris game using React, focusing on smooth gameplay mechanics and responsive design.",
            "img": "/images/projects/tetris-game.png",
            "tech": ["React"],
            "url": "https://github.com/"
        }
    }
}
