{
    "name": "Daniil Krasilnikov",
    "logo_name": "dankrasilnikov",
    "role": "FullStack Developer",
    "about": {
        "sections": {
            "professional-info": {
                "title": "professional-info",
                "icon": "icons/info-professional.svg",
                "info": {
                    "experience": {
                        "title": "experience",
                        "description": "<br>With over 4 years of professional experience, I have developed scalable web applications, worked on innovative IoT solutions, and contributed to high-performance backend systems. My portfolio includes projects ranging from user-friendly interfaces to data-intensive platforms. I excel in delivering quality work under tight deadlines and am passionate about implementing creative and effective solutions for challenging problems."
                    },
                    "hard-skills": {
                        "title": "hard-skills",
                        "description": "<br>I specialize in modern web technologies like React, Vue, and Angular for frontend development, and Node.js with Express for backend systems. My expertise extends to databases such as MongoDB and PostgreSQL. In IoT, I have worked extensively with protocols like MQTT and WebSockets, integrating hardware like Raspberry Pi and Arduino to create functional prototypes and production-level solutions."
                    },
                    "soft-skills": {
                        "title": "soft-skills",
                        "description": "<br>I am a collaborative team player with strong communication skills. My ability to lead and manage projects ensures timely delivery of tasks without compromising quality. I am highly adaptable, detail-oriented, and driven by a passion for continuous learning and self-improvement."
                    }
                }
            },
            "personal-info": {
                "title": "Personal Info",
                "icon": "icons/info-personal.svg",
                "info": {
                    "bio": {
                        "title": "Bio",
                        "description": "<br><strong>About Me</strong><br> With 5 years of experience in web development, I specialize in creating high-performance web applications and exploring the potential of IoT and robotics. My passion lies in building innovative solutions that bridge the gap between software and hardware. I enjoy tackling challenging projects that require creativity, precision, and technical expertise."
                    },
                    "interests": {
                        "title": "Interests",
                        "description": "<br><strong>Interests</strong><br> I am deeply passionate about IoT, robotics, and cutting-edge technology. I constantly learn about new frameworks, hardware integrations, and AI advancements. In my free time, I contribute to open-source projects and explore creative applications of technology in real-world scenarios."
                    },
                    "education": {
                        "title": "Education",
                        "description": "<br><strong>Education</strong><br> My journey in technology began with self-taught programming and has grown into a structured study of computer science. Currently, I am pursuing a degree in Computer Science, focusing on IoT systems and artificial intelligence. My education has been supplemented with numerous online courses, certifications, and practical projects, allowing me to stay at the forefront of technology.",
                        "files": {
                            "high-school": "Graduated with honors from Las Viñas High School, building a strong foundation in mathematics and computer science.",
                            "university": "Currently studying Computer Science with a focus on IoT and AI applications, aiming to integrate innovative solutions into practical scenarios."
                        }
                    }
                }
            },
            "hobbies-info": {
                "title": "Hobbies",
                "icon": "icons/info-hobbies.svg",
                "info": {
                    "sports": {
                        "title": "Sports",
                        "description": "<br><strong>Sports</strong><br> I am deeply passionate about sports that challenge both the mind and body. As a fencing enthusiast, I enjoy the precision, strategy, and discipline that this sport requires. Fencing helps me sharpen my focus, improve my reflexes, and maintain a healthy balance between mental and physical well-being."
                    },
                    "robotics": {
                        "title": "Robotics",
                        "description": "<br><strong>Robotics</strong><br> Robotics is not just a professional interest for me, but also a hobby. I spend my free time experimenting with microcontrollers like Arduino and Raspberry Pi, building small robotic systems, and exploring how hardware and software can seamlessly integrate to solve real-world problems. This hands-on exploration fuels my creativity and helps me stay ahead in the rapidly evolving field of technology."
                    }
                }
            }

        }
    },
    "contacts": {
        "direct": {
            "title": "contacts",
            "sources": {
                "email": "krasilnikov.orchid@gmail.com",
                "phone": "+995599477339"
            }
        },
        "social": {
            "github": {
                "title": "Github profile",
                "url": "https://github.com/",
                "user": "dankrasilnikov"
            },
            "facebook": {
                "title": "Facebook profile",
                "url": "https://facebook.com/",
                "user": "username"
            },
            "twitter": {
                "title": "Twitter account",
                "url": "https://twitter.com/",
                "user": "username"
            }
        },
        "find_me_also_in": {
            "title": "find-me-also-in",
            "sources": {
                "threads": {
                    "title": "Threads account",
                    "url": "https://www.threads.net/",
                    "user": "dan_krasilnikov"
                },
                "instagram": {
                    "title": "Instagram account",
                    "url": "https://www.instagram.com/",
                    "user": "dan_krasilnikov"
                },
                "linkedin": {
                    "title": "LinkedIn profile",
                    "url": "https://www.linkedin.com/in/",
                    "user": "daniil-krasilnikov"
                }
            }
        }
    },
    "gists": {
        "1": "83861a67e377633ee8368df01ee3a355",
        "2": "694c1f32332788a2ac7f37b09e5aa40e"
    },
    "projects": {
        "1": {
            "title": "Terra.do",
            "description": "Climate education platform designed to help individuals and organizations learn about and address climate change.",
            "img": "/images/projects/terra-do.png",
            "tech": ["React", "Node.js"],
            "url": "https://terra.do"
        },
        "2": {
            "title": "ClipFlip",
            "description": "A video marketing SaaS platform that enables businesses to create, manage, and distribute marketing videos effectively.",
            "img": "/images/projects/clipflip.png",
            "tech": ["Next.js", "TypeScript"],
            "url": "https://clipflip.video"
        },
        "3": {
            "title": "Mobioffice",
            "description": "Business solutions SaaS that streamlines office operations and improves team collaboration through innovative tools.",
            "img": "/images/projects/mobioffice.png",
            "tech": ["Angular", "Express.js"],
            "url": "https://mobioffice.io"
        },
        "4": {
            "title": "Kgirdharlal",
            "description": "Jewelry e-commerce store providing a seamless shopping experience for high-quality, beautifully designed jewelry pieces.",
            "img": "/images/projects/kgirdharlal.png",
            "tech": ["Shopify", "Liquid"],
            "url": "https://kgirdharlal.com"
        },
        "5": {
            "title": "Meds Recognition App",
            "description": "An AI-powered application that helps users recognize and manage their medications through image recognition.",
            "img": "/images/projects/meds-recognition.png",
            "tech": ["Python", "TensorFlow", "Flutter"],
            "url": "https://github.com/"
        },
        "6": {
            "title": "Electronics Education Platform",
            "description": "A learning platform designed to teach users about electronics, IoT, and robotics through interactive tutorials and projects.",
            "img": "/images/projects/electronics-education.png",
            "tech": ["Vue", "Node.js", "MongoDB"],
            "url": "https://github.com/"
        }
    }
}
